<template>
    <div>
        JavaScript使用的是 堆(Heap) 和 栈( Stack)
        JavaScript基本类型数据都是直接按值存储在栈中的(Undefined、Null、不是new出来的布尔、数字和字符串)，每种类型的数据占用的内存空间的大小是确定的，并由系统自动分配和自动释放。这样带来的好处就是，内存可以及时得到回收，相对于堆来说
        ，更加容易管理内存空间。 JavaScript引用类型数据被存储于堆中
        (如对象、数组、函数等，它们是通过拷贝和new出来的）。其实，说存储于堆中，也不太准确，因为，引用类型的数据的地址指针是存储于栈中的，当我们想要访问引用类型的值的时候，需要先从栈中获得对象的地址指针，然后，在通过地址指针找到堆中的所需要的数据。
        作者：一只野生前端 链接：https://www.jianshu.com/p/7d3ab9a22b11 来源：简书
        著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    </div>
</template>

<script>
export default {
    name: "TabA",
};
</script>
